#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//国王将金币作为工资，发放给忠诚的骑士。第一天，骑士收到
//一枚金币；之后两天（第二天和第三天），每天收到两枚金币；
//之后三天（第四、五、六天），每天收到三枚金币；之后四
//天（第七、八、九、十天），每天收到四枚金币……；这种工资
//发放模式会一直这样延续下去：当连续N天每天收到N枚金币后，
//骑士会在之后的连续N+1天里，每天收到N+1枚金币。
//请计算在前K天里，骑士一共获得了多少金币。
//
//
//int gold(int k)
//{
//	int n = 0;
//	int sum = 0;
//	while (1)
//	{
//		n++;
//		int i = 0;
//		for (i = 0; i < n; i++)
//		{
//			k--;
//			sum += n;
//			if (k == 0)
//			{
//				return sum;
//			}
//		}
//	}
//}
//
//int main()
//{
//	int k = 0;
//	scanf("%d", &k);
//	printf("%d\n", gold(k));
// 	return 0;
//}




//-----------------------------------------------
//打印回文数
// 
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int i = 0;
//	for (i = 1; i <= n; i++)
//	{
//		int tmp = 0;
//		int num = i;
//		while (num)
//		{
//			tmp = tmp * 10 + num % 10;
//			num /= 10;
//		}
//		if (tmp == i)
//		{
//			printf("%d ", i);
//		}
//	}
//	return 0;
//}
// 
//tips:对每个数进行检验，检验方法为将该数反写，比较两数是否相同，相同则为回文数。




//-----------------------------------------------
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“*”组成的线段图案
//多组输入，一个整数（1~100），表示线段长度，即“*”的数量
//
//int main()
//{
//	int num = 0;
//	while (scanf("%d", &num) != EOF)
//	{
//		int i = 0;
//		for (i = 0; i < num; i++)
//		{
//			printf("*");
//		}
//		printf("\n");
//	}
//	return 0;
//}




//-----------------------------------------------
//多组输入，一个整数（1~20），表示正方形的长度，也表示输出行数
//
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 0; i < n; i++)
//		{
//			for (j = 0; j < n; j++)
//			{
//				printf("* ");
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//多组输入，一个整数（2~20），表示直角三角形直角边的长度，即“*”的数量，也表示输出行数
//
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 0; i < n; i++)
//		{
//			for (j = 0; j <= i; j++)
//			{
//				printf("* ");
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//多组输入，一个整数（2~20），表示翻转直角三角形直角边的长度，即“*”的数量，也表示输出行数
//
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 0; i < n; i++)
//		{
//			for (j = 0; j < n - i; j++)
//			{
//				printf("* ");
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//多组输入，一个整数（2~20），表示直角三角形直角边的长度，即“*”的数量，也表示输出行数
//
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 0; i < n; i++)
//		{
//			for (j = 0; j < n - i - 1; j++)
//			{
//				printf("  ");
//			}
//			for (j = 0; j <= i; j++)
//			{
//				printf("* ");
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“*”组成的金字塔图案
//多组输入，一个整数（2~20），表示金字塔边的长度，即“*”的数量，，也表示输出行数
//
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 0; i < n; i++)
//		{
//			for (j = 0; j < n - i - 1; j++)
//			{
//				printf(" ");
//			}
//			for (j = 0; j <= i; j++)
//			{
//				printf("* ");
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“*”组成的翻转金字塔图案
//多组输入，一个整数（2~20），表示翻转金字塔边的长度，即“*”的数量，也表示输出行数
//
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 0; i < n; i++)
//		{
//			for (j = 0; j < i; j++)
//			{
//				printf(" ");
//			}
//			for (j = 0; j < n - i; j++)
//			{
//				printf("* ");
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“*”组成的菱形图案
//多组输入，一个整数（2~20）
//
//int main()
//{
//	int line = 0;
//	while (scanf("%d", &line) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 0; i < line + 1; i++)
//		{
//			for (j = 0; j < line - i; j++)
//			{
//				printf(" ");
//			}
//			for (j = 0; j <= i; j++)
//			{
//				printf("* ");
//			}
//			printf("\n");
//		}
//
//		for (i = 0; i < line; i++)
//		{
//			for (j = 0; j <= i; j++)
//			{
//				printf(" ");
//			}
//			for (j = 0; j < line - i; j++)
//			{
//				printf("* ");
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“*”组成的K形图案
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < n + 1; i++)
//	{
//		for (j = 0; j < n + 1 - i; j++)
//		{
//			printf("* ");
//		}
//		printf("\n");
//	}
//
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j <= i + 1; j++)
//		{
//			printf("* ");
//		}
//		printf("\n");
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“*”组成的箭形图案
//
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 0; i < n + 1; i++)
//		{
//			for (j = 0; j < 2 * (n - i); j++)
//			{
//				printf(" ");
//			}
//			for (j = 0; j <= i; j++)
//			{
//				printf("*");
//			}
//			printf("\n");
//		}
//
//		for (i = 0; i < n; i++)
//		{
//			for (j = 0; j < 2 * (i + 1); j++)
//			{
//				printf(" ");
//			}
//			for (j = 0; j < n - i; j++)
//			{
//				printf("*");
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“*”组成的反斜线形图案
//多组输入，一个整数（2~20），表示输出的行数，也表示组成反斜线的“*”的数量
//
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 0; i < n; i++)
//		{
//			for (j = 0; j < i; j++)
//			{
//				printf(" ");
//			}
//			printf("*");
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“*”组成的正斜线形图案
//多组输入，一个整数（2~20），表示输出的行数，也表示组成正斜线的“*”的数量
//
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 0; i < n; i++)
//		{
//			for (j = 0; j < n - i - 1; j++)
//			{
//				printf(" ");
//			}
//			printf("*");
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，
//该任务是打印用“*”组成的“空心”正方形图案
//多组输入，一个整数（3~20），表示输出的行数，也表示组成正方形边的“*”的数量
//
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 0; i < n; i++)
//		{
//			for (j = 0; j < n; j++)
//			{
//				if (i == 0 || i == n - 1)
//				{
//					printf("* ");
//				}
//				else if (j == 0 || j == n - 1)
//				{
//					printf("* ");
//				}
//				else
//				{
//					printf("  ");
//				}
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“*”组成的“空心”三角形图案
//多组输入，一个整数（3~20），表示输出的行数，也表示组成三角形边的“*”的数量
//
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 0; i < n; i++)
//		{
//			for (j = 0; j < n; j++)
//			{
//				if (i == n - 1)
//				{
//					printf("* ");
//				}
//				else if ((j == 0) || (j == i))
//				{
//					printf("* ");
//				}
//				else
//				{
//					printf("  ");
//				}
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用数字组成的数字三角形图案
//多组输入，一个整数（3~20），表示数字三角形边的长度，即数字的数量，也表示输出行数
//
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		int j = 0;
//		for (i = 1; i <= n; i++)
//		{
//			for (j = 1; j <= i; j++)
//			{
//				printf("%d ", j);
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}




//-----------------------------------------------  <待完善>
//今天是圣诞节，牛牛要打印一个漂亮的圣诞树送给想象中的女朋友，请你帮助他实现梦想
//
//int main()
//{
//	int h = 0;
//	scanf("%d", &h);
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < h * 3; i++)
//	{
//		for (j = 0; j < h * 3 + i; j++)
//		{
//			if (j < h * 3 - i - 1)
//			{
//				printf(" ");
//			}
//			else
//			{
//				if ((i % 2 == 0 && j % 2 == 0) || (i % 2 != 0 && j % 2 != 0))
//				{
//					printf("*");
//				}
//				else
//				{
//					printf(" ");
//				}
//			}
//		}
//		printf("\n");
//	}
//	return 0;
//}




//-----------------------------------------------
//试计算在区间1 到n 的所有整数中，数字x（0 ≤ x ≤ 9）共出现了多少次？
//例如，在1到11 中，即在1、2、3、4、5、6、7、8、9、10、11 中，数字1 出现了4 次
//
//int main()
//{
//	int n = 0;
//	int x = 0;
//	scanf("%d %d", &n, &x);
//	int count = 0;
//	int i = 0;
//	for (i = 1; i <= n; i++)
//	{
//		int tmp = i;
//		while (tmp)
//		{
//			if (tmp % 10 == x)
//			{
//				count++;
//			}
//			tmp /= 10;
//		}
//	}
//	printf("%d\n", count);
//	return 0;
//}




//-----------------------------------------------
//输入10个整数，要求按输入时的逆序把这10个数打印出来。逆序输出，就是按照输入相反的顺序打印这10个数
//
//int main()
//{
//	int arr[10] = { 0 };
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		scanf("%d", &arr[i]);
//	}
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%d ", arr[i]);
//	}
//	return 0;
//}




//-----------------------------------------------
//输入数字N，然后输入N个数，计算这N个数的和
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int arr[50] = { 0 };
//	int i = 0;
//	for (i = 0; i < n; i++)
//	{
//		scanf("%d", &arr[i]);
//	}
//	int sum = 0;
//	for (i = 0; i < n; i++)
//	{
//		sum += arr[i];
//	}
//	printf("%d\n", sum);
//	return 0;
//}




//-----------------------------------------------
//期中考试开始了，大家都想取得好成绩，争夺前五名
//从键盘输入 n 个学生成绩，输出每组排在前五高的成绩
//两行，第一行输入一个整数，表示n个学生（>=5），
//第二行输入n个学生成绩（整数表示，范围0~100），用空格分隔
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int arr[50] = { 0 };
//	int i = 0;
//	for (i = 0; i < n; i++)
//	{
//		scanf("%d", &arr[i]);
//	}
//	int cur = 0;
//	int p = 0;
//	int max = 0;
//	for (p = 0; p < 5; p++)
//	{
//		cur = p;
//		max = cur;
//		for (; cur < n; cur++)
//		{
//			if (arr[cur] > arr[max])
//			{
//				max = cur;
//			}
//		}
//		int tmp = arr[p];
//		arr[p] = arr[max];
//		arr[max] = tmp;
//	}
//	for (i = 0; i < 5; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//	return 0;
//}




//-----------------------------------------------
//输入一个整数序列，判断是否是有序序列，
//有序，指序列中的整数从小到大排序或者从大到小排序(相同元素也视为有序)
//第一行输入一个整数N(3≤N≤50)。
//第二行输入N个整数，用空格分隔N个整数
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int arr[50] = { 0 };
//	int i = 0;
//	for (i = 0; i < n; i++)
//	{
//		scanf("%d", &arr[i]);
//	}
//	int c1 = 0;
//	int c2 = 0;
//	for (i = 0; i < n - 1; i++)
//	{
//		if (arr[i] - arr[i + 1] < 0)
//		{
//			c1++;
//		}
//		else
//		{
//			c2++;
//		}
//	}
//	if ((c1 == n - 1) || (c2 == n - 1))
//	{
//		printf("sorted\n");
//	}
//	else
//	{
//		printf("unsorted\n");
//	}
//	return 0;
//}




//-----------------------------------------------
//有一个有序数字序列，从小到大排序，将一个新输入的数插入到序列中，保证插入新数后，序列仍然是升序
//第一行输入一个整数N(0≤N≤50)
//第二行输入N个升序排列的整数，输入用空格分隔的N个整数
//第三行输入想要进行插入的一个整数
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int arr[51] = { 0 };
//	int i = 0;
//	for (i = 0; i < n; i++)
//	{
//		scanf("%d", &arr[i]);
//	}
//	int k = 0;
//	scanf("%d", &k);
//	for (i = n - 1; i >= 0; i--)
//	{
//		if (arr[i] > k)
//		{
//			arr[i + 1] = arr[i];
//		}
//		else
//		{
//			break;
//		}
//	}
//	arr[i + 1] = k;
//	for (i = 0; i < n + 1; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//	return 0;
//}




//-----------------------------------------------
//有一个整数序列（可能有重复的整数），现删除指定的某一个整数，
//输出删除指定数字之后的序列，序列中未被删除数字的前后位置没有发生改变
//第一行输入一个整数(0≤N≤50)
//第二行输入N个整数，输入用空格分隔的N个整数
//第三行输入想要进行删除的一个整数
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int arr[50] = { 0 };
//	int i = 0;
//	for (i = 0; i < n; i++)
//	{
//		scanf("%d", &arr[i]);
//	}
//	int d = 0;
//	scanf("%d", &d);
//	
//	for (i = 0; i < n; i++)
//	{
//		if (arr[i] != d)
//		{
//			printf("%d ", arr[i]);
//		}
//	}
//	return 0;
//}




//-----------------------------------------------
//输入n个整数的序列，要求对这个序列进行去重操作
//所谓去重，是指对这个序列中每个重复出现的整数，只保留该数第一次出现的位置，删除其余位置
//输入包含两行，第一行包含一个正整数n（1 ≤ n ≤ 1000），表示第二行序列中数字的个数；
//第二行包含n个整数（范围1~5000），用空格分隔
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int arr1[1000] = { 0 };
//	int arr2[1000] = { 0 };
//	int i = 0;
//	int j = 0;
//	int k = 0;
//	for (i = 0; i < n; i++)
//	{
//		int flag = 1;
//		scanf("%d", &arr1[i]);
//		for (j = 0; j < k; j++)
//		{
//			if (arr2[j] == arr1[i])
//			{
//				flag = 0;
//				break;
//			}
//		}
//		if (flag)
//		{
//			arr2[k++] = arr1[i];
//		}
//	}
//	for (j = 0; j < k; j++)
//	{
//		printf("%d ", arr2[j]);
//	}
//	return 0;
//}




//-----------------------------------------------
//给定n个整数和一个整数x，小乐乐想从n个整数中判断x出现几次，请编程帮他实现
//第一行，一个整数，表示n（1 <= n <= 100）
//第二行，共输入n个整数，两个整数之间用空格分隔
//第三行，输入一个整数，表示要查找的整数x
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int arr[100] = { 0 };
//	int i = 0;
//	for (i = 0; i < n; i++)
//	{
//		scanf("%d", &arr[i]);
//	}
//	int x = 0;
//	scanf("%d", &x);
//	int count = 0;
//	for (i = 0; i < n; i++)
//	{
//		if (arr[i] == x)
//		{
//			count++;
//		}
//	}
//	printf("%d\n", count);
//	return 0;
//}




//-----------------------------------------------
//用筛选法求n以内的素数。筛选法求解过程为：将2~n之间的正整数放在数组内存储，
//将数组中2之后的所有能被2整除的数清0，再将3之后的所有能被3整除的数清0 ，
//以此类推，直到n为止。数组中不为0 的数即为素数
//多组输入，每行输入一个正整数（不大于100）
//
//int main()
//{
//	int arr1[100] = { 0 };
//	int arr2[100] = { 0 };
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int count = 0;
//		int k = 2;
//		int i = 0;
//		int j = 0;
//		for (i = 0; i <= n - 2; i++)
//		{
//			if (k <= n)
//			{
//				arr1[i] = k++;
//				arr2[i] = arr1[i];
//			}
//		}
//		//判断并且置0
//		for (i = 0; i <= n - 2; i++)
//		{
//			for (j = i + 1; j <= n - 2; j++)
//			{
//				if ((arr2[j] != 0) && (arr2[j] % arr1[i] == 0))
//				{
//					arr2[j] = 0;
//					count++;
//				}
//			}
//		}
//		for (j = 0; j <= n - 2; j++)
//		{
//			if (arr2[j])
//			{
//				printf("%d ", arr2[j]);
//			}
//		}
//		printf("\n%d\n", count);
//	}
//	return 0;
//}




//-----------------------------------------------
//输入一个班级5个学生各5科成绩，输出5个学生各5科成绩及总分
//输入：五行，每行输入一个学生各5科成绩（浮点数表示，范围0.0~100.0），用空格分隔
//输出：五行，按照输入顺序每行输出一个学生的5科成绩及总分（小数点保留1位），用空格分隔
//
//int main()
//{
//	double arr[5][6] = { 0.0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 5; i++)
//	{
//		for (j = 0; j < 5; j++)
//		{
//			scanf("%lf", &arr[i][j]);
//			arr[i][5] += arr[i][j];
//		}
//	}
//	for (i = 0; i < 5; i++)
//	{
//		for (j = 0; j < 6; j++)
//		{
//			printf("%.1lf ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi得到了一个n行m列的矩阵，现在他想知道第x行第y列的值是多少，请你帮助他完成这个任务
//第一行包含两个数n和m，表示这个矩阵包含n行m列。
//从2到n+1行，每行输入m个整数（范围-231~231-1），用空格分隔，共输入n*m个数，
//表示矩阵中的元素。接下来一行输入x和y，用空格分隔，表示KiKi想得到的元素的位置。
//(1≤x≤n≤10，1≤y≤m≤10)
//
//int main()
//{
//	int n = 0;
//	int m = 0;
//	scanf("%d %d", &n, &m);
//	int arr[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < m; j++)
//		{
//			scanf("%d", &arr[i][j]);
//		}
//	}
//	int x = 0;
//	int y = 0;
//	scanf("%d %d", &x, &y);
//	printf("%d\n", arr[x - 1][y - 1]);
//	return 0;
//}




//-----------------------------------------------
//KiKi想从n行m列的方阵队列中找到身高最高的人的位置，请你帮助他完成这个任务
//第一行包含两个整数n和m，表示这个方阵队列包含n行m列。
//从2到n+1行，每行输入m个整数（范围-231~231-1），用空格分隔，共输入n*m个数，
//表示方阵中的所有人的身高（保证输入身高都不相同）。(1≤x≤n≤10，1≤y≤m≤10)
//
//int main()
//{
//	int n = 0;
//	int m = 0;
//	scanf("%d %d", &n, &m);
//	int arr[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < m; j++)
//		{
//			scanf("%d", &arr[i][j]);
//		}
//	}
//	int x = 0;
//	int y = 0;
//	int max = arr[0][0];
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < m; j++)
//		{
//			if (arr[i][j] > max)
//			{
//				max = arr[i][j];
//				x = i;
//				y = j;
//			}
//		}
//	}
//	printf("%d %d\n", x + 1, y + 1);
//	return 0;
//}




//-----------------------------------------------
//KiKi得到了两个n行m列的矩阵，他想知道两个矩阵是否相等，请你回答他
//(当两个矩阵对应数组元素都相等时两个矩阵相等)
//第一行包含两个整数n和m，表示两个矩阵包含n行m列，用空格分隔。
//从2到n + 1行，每行输入m个整数（范围 - 231~231 - 1），用空格分隔，共输入n * m个数，表示第一个矩阵中的元素。
//从n + 2行到2n + 1，每行输入m个整数（范围 - 231~231 - 1），用空格分隔，共输入n * m个数，表示第二个矩阵中的元素。
//1 < n, m < 10
//
//int main()
//{
//	int n = 0;
//	int m = 0;
//	scanf("%d %d", &n, &m);
//	int arr1[10][10] = { 0 };
//	int arr2[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < m; j++)
//		{
//			scanf("%d", &arr1[i][j]);
//		}
//	}
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < m; j++)
//		{
//			scanf("%d", &arr2[i][j]);
//		}
//	}
//	int flag = 1;
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < m; j++)
//		{
//			if (arr1[i][j] != arr2[i][j])
//			{
//				flag = 0;
//				break;
//			}
//		}
//	}
//	if (flag)
//	{
//		printf("Yes\n");
//	}
//	else
//	{
//		printf("No\n");
//	}
//	return 0;
//}




//-----------------------------------------------
//输入NxM矩阵，矩阵元素均为整数，计算其中大于零的元素之和
//第一行为N M(N: 矩阵行数；M: 矩阵列数,且M,N<=10)，接下来的N行为矩阵各行
//
//int main()
//{
//	int n = 0;
//	int m = 0;
//	scanf("%d %d", &n, &m);
//	int arr[10][10] = { 0 };
//	int sum = 0;
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < m; j++)
//		{
//			scanf("%d", &arr[i][j]);
//			if (arr[i][j] > 0)
//			{
//				sum += arr[i][j];
//			}
//		}
//	}
//	printf("%d\n", sum);
//	return 0;
//}




//-----------------------------------------------
//给你一个整数n，按要求输出n∗n的回型矩阵
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int arr[19][19] = { 0 };
//	int i = 0;
//	int j = 0;
//	int x = 0;
//	int y = n - 1;
//	int count = 1;
//	while (count != n * n + 1)
//	{
//		for (i = x, j = x; j <= y; j++)
//		{
//			arr[i][j] = count++;
//		}
//		for (i = x + 1, j -= 1; i <= y; i++)
//		{
//			arr[i][j] = count++;
//		}
//		for (j = y - 1, i -= 1; j >= x; j--)
//		{
//			arr[i][j] = count++;
//		}
//		for (i = y - 1, j += 1; i >= x + 1; i--)
//		{
//			arr[i][j] = count++;
//		}
//		x++;
//		y--;
//	}
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < n; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}





//-----------------------------------------------
//给出两幅相同大小的黑白图像（用0-1矩阵）表示，求它们的相似度
//若两幅图像在相同位置上的像素点颜色相同，则称它们在该位置具有相同的像素点
//两幅图像的相似度定义为相同像素点数占总像素点数的百分比
//
//第一行包含两个整数m和n，表示图像的行数和列数，用单个空格隔开
//1≤m≤100, 1≤n≤100。之后m行，每行n个整数0或1，表示第一幅黑白图像上各像素点的颜色，相邻两个数用单个空格隔开
//之后m行，每行n个整数0或1，表示第二幅黑白图像上各像素点的颜色，相邻两个数用单个空格隔开
//
//int main()
//{
//	int m = 0;
//	int n = 0;
//	scanf("%d %d", &m, &n);
//	int arr1[100][100] = { 0 };
//	int arr2[100][100] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < m; i++)
//	{
//		for (j = 0; j < n; j++)
//		{
//			scanf("%d", &arr1[i][j]);
//		}
//	}
//	for (i = 0; i < m; i++)
//	{
//		for (j = 0; j < n; j++)
//		{
//			scanf("%d", &arr2[i][j]);
//		}
//	}
//	int count = 0;
//	for (i = 0; i < m; i++)
//	{
//		for (j = 0; j < n; j++)
//		{
//			if (arr1[i][j] == arr2[i][j])
//			{
//				count++;
//			}
//		}
//	}
//	double percentage = 100.0 * count / (m * n);
//	printf("%.2lf", percentage);
//	return 0;
//}




//-----------------------------------------------
//KiKi想知道一个n阶方矩是否为上三角矩阵，请帮他编程判定
//上三角矩阵即主对角线以下的元素都为0的矩阵，主对角线为从矩阵的左上角至右下角的连线
//第一行包含一个整数n，表示一个方阵包含n行n列，用空格分隔。 (2≤n≤10)
//从2到n + 1行，每行输入n个整数（范围 - 231~231 - 1），用空格分隔，共输入n * n个数
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int arr[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < n; j++)
//		{
//			scanf("%d", &arr[i][j]);
//		}
//	}
//	int flag = 1;
//	for (i = 1; i < n; i++)
//	{
//		for (j = 0; j < i; j++)
//		{
//			if (arr[i][j] != 0)
//			{
//				flag = 0;
//				goto out;
//			}
//		}
//	}
//out:
//	if (flag)
//	{
//		printf("YES\n");
//	}
//	else
//	{
//		printf("NO\n");
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi现在得到一个包含n*m个数的整数序列，现在他需要把这n*m个数
//按顺序规划成一个n行m列的矩阵并输出，请你帮他完成这个任务
//
//int main()
//{
//	int n = 0;
//	int m = 0;
//	scanf("%d %d", &n, &m);
//	int arr[100] = { 0 };
//	int i = 0;
//	for (i = 0; i < n * m; i++)
//	{
//		scanf("%d", &arr[i]);
//	}
//	for (i = 0; i < n * m; i++)
//	{
//		if ((i != 0) && (i % m == 0))
//		{
//			printf("\n");
//		}
//		printf("%d ", arr[i]);
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi有一个矩阵，他想知道转置后的矩阵（将矩阵的行列互换得到的新矩阵称为转置矩阵），请编程帮他解答
//第一行包含两个整数n和m，表示一个矩阵包含n行m列，用空格分隔。 (1≤n≤10,1≤m≤10)
//从2到n + 1行，每行输入m个整数（范围 - 231~231 - 1），用空格分隔，共输入n * m个数，表示第一个矩阵中的元素
//
//int main()
//{
//	int n = 0;
//	int m = 0;
//	scanf("%d %d", &n, &m);
//	int arr[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < m; j++)
//		{
//			scanf("%d", &arr[i][j]);
//		}
//	}
//	for (j = 0; j < m; j++)
//	{
//		for (i = 0; i < n; i++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi有一个矩阵，他想知道经过k次行变换或列变换后得到的矩阵
//第一行包含两个整数n和m，表示一个矩阵包含n行m列，用空格分隔。 (1≤n≤10,1≤m≤10)
//从2到n + 1行，每行输入m个整数（范围 - 231~231 - 1），用空格分隔，共输入n * m个数，表示第一个矩阵中的元素。
//接下来一行输入k，表示要执行k次操作（1≤k≤5）。接下来有k行，每行包括一个字符t和两个数a和b，中间用空格格分隔，
//t代表需要执行的操作，当t为字符'r'时代表进行行变换，当t为字符'c'时代表进行列变换，a和b为需要互换的行或列
//（1≤a≤b≤n≤10，1≤a≤b≤m≤10）
//提示：当t为别的字符时不需要处理
//
//int main()
//{
//	int n = 0;
//	int m = 0;
//	scanf("%d %d", &n, &m);
//	int arr[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < m; j++)
//		{
//			scanf("%d", &arr[i][j]);
//		}
//	}
//	int k = 0;
//	scanf("%d", &k);
//	char t = 0;
//	int a = 0;
//	int b = 0;
//	while (k--)
//	{
//		getchar();
//		scanf("%c %d %d", &t, &a, &b);
//		if (t == 't')
//		{
//			;
//		}
//		else if (t == 'r')
//		{
//			int j = 0;
//			for (j = 0; j < m; j++)
//			{
//				int tmp = arr[a - 1][j];
//				arr[a - 1][j] = arr[b - 1][j];
//				arr[b - 1][j] = tmp;
//			}
//		}
//		else if (t == 'c')
//		{
//			int i = 0;
//			for (i = 0; i < n; i++)
//			{
//				int tmp = arr[i][a - 1];
//				arr[i][a - 1] = arr[i][b - 1];
//				arr[i][b - 1] = tmp;
//			}
//		}
//	}
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < m; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi知道什么叫杨辉三角之后对杨辉三角产生了浓厚的兴趣，他想知道杨辉三角的前n行
//杨辉三角，本质上是二项式(a+b)的n次方展开后各项的系数排成的三角形。
//其性质包括：每行的端点数为1， 一个数也为1；每个数等于它左上方和上方的两数之和
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int arr[50][50] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < n; i++)
//	{
//		arr[i][0] = 1;
//	}
//	for (i = 1; i < n; i++)
//	{
//		for (j = 1; j <= i; j++)
//		{
//			arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
//		}
//	}
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			printf("%5d", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}




//-----------------------------------------------
//KiKi和BoBo玩 “井”字棋。也就是在九宫格中，
//只要任意行、列，或者任意对角线上面出现三个连续相同的棋子，就能获胜请根据棋盘状态，判断当前输赢
//
//char Is_win(char board[3][3])
//{
//	int i = 0;
//	for (i = 0; i < 3; i++)
//	{
//		if (board[i][0] == board[i][1] && board[i][1] == board[i][2] && board[i][1] != 'O')
//		{
//			return board[i][1];
//		}
//	}
//	for (i = 0; i < 3; i++)
//	{
//		if (board[0][i] == board[1][i] && board[1][i] == board[2][i] && board[1][i] != 'O')
//		{
//			return board[1][i];
//		}
//	}
//	if (board[0][0] == board[1][1] && board[1][1] == board[2][2] && board[1][1] != 'O')
//	{
//		return board[1][1];
//	}
//	else if (board[0][2] == board[1][1] && board[1][1] == board[2][0] && board[1][1] != 'O')
//	{
//		return board[1][1];
//	}
//	return 'N';
//}
//
//int main()
//{
//	char board[3][3] = { 'O'};
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 3; j++)
//		{
//			scanf(" %c", &board[i][j]);
//		}
//	}
//	char ret = Is_win(board);
//	if (ret == 'K')
//	{
//		printf("KiKi wins!\n");
//	}
//	else if (ret == 'B')
//	{
//		printf("BoBo wins!\n");
//	}
//	else if (ret == 'N')
//	{
//		printf("No winner!\n");
//	}
//	return 0;
//}




//-----------------------------------------------
//小sun上课的时候非常喜欢玩扫雷。他现小sun有一个初始的雷矩阵，他希望你帮他生成一个扫雷矩阵
//扫雷矩阵的每一行每一列都是一个数字，每个数字的含义是与当前位置相邻的8个方向中，有多少个雷
//（在下图中，雷用* 表示）；如果当前位置就是雷的话，仍输出一个*
//
//int main()
//{
//	int n = 0;
//	int m = 0;
//	scanf("%d %d", &n, &m);
//	char board[1002][1002] = { '.' };
//	int i = 0;
//	int j = 0;
//	for (i = 1; i < n + 1; i++)
//	{
//		for (j = 1; j < m + 1; j++)
//		{
//			scanf(" %c", &board[i][j]);
//		}
//	}
//	for (i = 1; i < n + 1; i++)
//	{
//		for (j = 1; j < m + 1; j++)
//		{
//			if (board[i][j] == '.')
//			{
//				int count = 0;
//				if (board[i - 1][j] == '*')
//					count++;
//				if (board[i - 1][j + 1] == '*')
//					count++;
//				if (board[i][j + 1] == '*')
//					count++;
//				if (board[i + 1][j + 1] == '*')
//					count++;
//				if (board[i + 1][j] == '*')
//					count++;
//				if (board[i + 1][j - 1] == '*')
//					count++;
//				if (board[i][j - 1] == '*')
//					count++;
//				if (board[i - 1][j - 1] == '*')
//					count++;
//				board[i][j] = count + '0';
//			}
//			else
//			{
//				;
//			}
//		}
//	}
//	for (i = 1; i < n + 1; i++)
//	{
//		for (j = 1; j < m + 1; j++)
//		{
//			printf("%c", board[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}




//-----------------------------------------------
//凯刚写了一篇美妙的作文，请问这篇作文的标题中有多少个字符
//注意：标题中可能包含大、小写英文字母、数字字符、空格和换行符。统计标题字 符数时，空格和换行符不计算在内
//
//#include<string.h>
//
//int main()
//{
//	char s[20] = { 0 };
//	gets(s);
//	int len = strlen(s);
//	int count = 0;
//	int i = 0;
//	for (i = 0; i < len; i++)
//	{
//		if ((s[i] >= 'a' && s[i] <= 'z') || (s[i] >= 'A' && s[i] <= 'Z'))
//			count++;
//		else if (s[i] >= '0' && s[i] <= '9')
//			count++;
//	}
//	printf("%d\n", count);
//	return 0;
//}




//-----------------------------------------------
//有个软件系统登录的用户名和密码为（用户名：admin，密码：admin），用户输入用户名和密码，判断是否登录成功
//多组测试数据，每行有两个用空格分开的字符串，第一个为用户名，第二个为密码
//
//#include<string.h>
//
//int main()
//{
//	char id[20] = { 0 };
//	char pw[20] = { 0 };
//	while (scanf("%s %s", id, pw) != EOF)
//	{
//		if ((strcmp(id, "admin") == 0) && (strcmp(pw, "admin") == 0))
//		{
//			printf("Login Success\n");
//		}
//		else
//		{
//			printf("Login Fail!\n");
//		}
//	}
//	return 0;
//}